<script setup lang="ts">
import { NP, NH1, NH2, NH3, NText } from 'naive-ui';
</script>

<template>
    <NH1>生成参数</NH1>
    <NH2>启用关键词</NH2>
    <NP>
        Intellyricist 歌词生成器具有两个模型，一个模型可以由关键词生成歌词（代号为 K-模型），另一个模型只能由已有的歌词续写歌词（代号为 P-模型）。如果选中，那么程序将会使用 K-模型生成歌词；否则程序将会使用 P-模型生成歌词。
    </NP>
    <NP>
        如果不需要程序基于关键词生成歌词，而是基于已有歌词续写歌词，建议关闭「启用关键词」选项。
    </NP>
    <NH2>关键词列表</NH2>
    <NP>
        程序将会在列表中的关键词的基础上生成歌词。
    </NP>
    <NP>
        仅当「启用关键词」选项被选中时可用。
    </NP>
    <NH2>限定关键词</NH2>
    <NP>
        如果选中，那么程序将不会向生成的歌词中扩充除「关键词列表」中给出的关键词以外的其他关键词；否则程序会向生成的歌词中扩充其他的与所给关键词相关的意象。
    </NP>
    <NP>
        仅当「启用关键词」选项被选中时可用。当「将选中行作为 Prompt」选项被选中，「前缀空行」不为 0 ，或者「行 Prompt」不为空时，「限定关键词」必须选中。
    </NP>
    <NH2>将选中行作为 Prompt</NH2>
    <NP>
        如果选中，程序将会以「歌词编辑器」面板中选中的歌词为基础进行续写。
    </NP>
    <NH2>前缀空行</NH2>
    <NP>
        程序在 Prompt 中添加空行数量，用这种方式可以控制生成歌词的行数。一般来说，前缀空行越多，生成的歌词行数越少。请注意：如果前缀空行过多，基于关键词生成歌词的效果可能会不理想。该参数的缺省值为 0 。
    </NP>
    <NH2>行 Prompt</NH2>
    <NP>
        「行 Prompt」文本框中的文字将会作为程序所生成歌词的第一行的前缀，换言之，程序所生成歌词的第一行将会在「行 Prompt」文本框中的文字的基础上续写。请注意：如果选中行过多，生成歌词的效果可能会不理想。
    </NP>
    <NH2>高级参数</NH2>
    <NP>一般来说，高级参数无需修改。</NP>
    <NH3>设置 PyTorch 随机数种子</NH3>
    <NP>
        如果「设置 PyTorch 随机数种子」数字框不为空，那么在生成歌词之前，程序会调用 <NText code>torch.manual_seed</NText> 方法设置随机数种子。
    </NP>
    <NH3>API 地址</NH3>
    <NP>
        生成程序的 API 地址。该参数的缺省值为 <NText code>/api/generate</NText>。
    </NP>
    <NH3>伪生成</NH3>
    <NP>
        如果选中该选项，那么程序将会随机生成没有意义的歌词。该选项仅供测试使用。
    </NP>
    <NH1>执行生成</NH1>
    <NP>
        按下「生成」按钮，程序即可开始生成歌词。程序支持使用相同参数生成不同歌词，要使用此功能，需要在「批量生成」数字框内指定生成次数。在生成过程中按下「中止」按钮即可停止生成。
    </NP>
    <NP>
        程序所生成的歌词会呈现在歌词候选区内。呈现在歌词候选区内的歌词无法编辑，要想手动修改歌词，请按下「添加」按钮，即可将歌词从歌词候选区移动到歌词编辑器当中。
    </NP>
    <NP>
        请注意，如果按下「生成」按钮，歌词候选区内的歌词会自动清空，请确保在此之前将所需歌词移动到歌词编辑器当中。
    </NP>
    <NH1>歌词编辑器</NH1>
    <NP>
        歌词编辑器是用于存储和编辑生成的歌词的模块。歌词编辑器中的歌词可以来自歌词生成模块的歌词候选区，也可以手动创建和编辑。
    </NP>
    <NP>
        按下「生成参数」区域上方的「编辑」按钮，即可在弹出的多行文本框执行文本编辑操作，该功能可以用于导入或导出歌词。
    </NP>
</template>