<script setup lang="ts">
import { NP, NH1, NH2, NH3, NText } from 'naive-ui';
</script>

<template>
    <NH1>生成参数</NH1>
    <NH2>启用关键词</NH2>
    <NP>
        Intellyricist 歌词生成器具有两个模型，一个模型可以由关键词生成歌词（代号为 K-模型），另一个模型只能由已有的歌词续写歌词（代号为 P-模型）。如果选中，那么程序将会使用 K-模型生成歌词；否则程序将会使用 P-模型生成歌词。
    </NP>
    <NH2>关键词列表</NH2>
    <NP>
        程序将会在列表中的关键词的基础上生成歌词。
    </NP>
    <NP>
        仅当「启用关键词」选项被选中时可用。
    </NP>
    <NH2>限定关键词</NH2>
    <NP>
        如果选中，那么程序将不会向生成的歌词中扩充除「关键词列表」中给出的关键词以外的其他关键词；否则程序会向生成的歌词中扩充其他的与所给关键词相关的意象。
    </NP>
    <NP>
        仅当「启用关键词」选项被选中时可用。当「将选中行作为 Prompt」选项被选中，「前缀空行」不为 0 ，或者「行 Prompt」不为空时，「限定关键词」必须选中。
    </NP>
    <NH2>将选中行作为 Prompt</NH2>
    <NP>
        如果选中，程序将会以「歌词编辑器」面板中选中的歌词为基础进行续写。
    </NP>
    <NH2>前缀空行</NH2>
    <NP>
        程序在 Prompt 中添加空行数量，用这种方式可以控制生成歌词的行数。一般来说，前缀空行越多，生成的歌词行数越少。请注意：如果前缀空行过多，基于关键词生成歌词的效果可能会不理想。该参数的缺省值为 0 。
    </NP>
    <NH2>行 Prompt</NH2>
    <NP>
        「行 Prompt」文本框中的文字将会作为程序所生成歌词的第一行的前缀，换言之，程序所生成歌词的第一行将会在「行 Prompt」文本框中的文字的基础上续写。
    </NP>
    <NH2>高级参数</NH2>
    <NP>一般来说，高级参数无需修改。</NP>
    <NH3>设置 PyTorch 随机数种子</NH3>
    <NP>
        如果「设置 PyTorch 随机数种子」数字框不为空，那么在生成歌词之前，程序会调用 <NText code>torch.manual_seed</NText> 方法设置随机数种子。
    </NP>
    <NH3>API 地址</NH3>
    <NP>
        生成程序的 API 地址。该参数的缺省值为 <NText code>/api/generate</NText>。
    </NP>
</template>